{
  "format": "custom_ensemble_model",
  "version": "1.0.0",
  "framework": "tensorflow_keras",
  "model_config": {
    "module": "keras.src.models.functional",
    "class_name": "Functional",
    "config": {
      "name": "EnsembleTransferLearning",
      "trainable": true,
      "layers": [
        {
          "module": "keras.layers",
          "class_name": "InputLayer",
          "config": {
            "batch_shape": [
              null,
              224,
              224,
              3
            ],
            "dtype": "float32",
            "sparse": false,
            "name": "ensemble_input"
          },
          "registered_name": null,
          "name": "ensemble_input",
          "inbound_nodes": []
        },
        {
          "module": "keras.src.ops.core",
          "class_name": "Cast",
          "config": {
            "dtype": "float16"
          },
          "registered_name": "Cast",
          "name": "cast_25",
          "inbound_nodes": [
            {
              "args": [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      224,
                      224,
                      3
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "ensemble_input",
                      0,
                      0
                    ]
                  }
                }
              ],
              "kwargs": {}
            }
          ]
        },
        {
          "module": "keras.src.ops.core",
          "class_name": "Cast",
          "config": {
            "dtype": "float16"
          },
          "registered_name": "Cast",
          "name": "cast_26",
          "inbound_nodes": [
            {
              "args": [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      224,
                      224,
                      3
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "ensemble_input",
                      0,
                      0
                    ]
                  }
                }
              ],
              "kwargs": {}
            }
          ]
        },
        {
          "module": "keras.src.ops.core",
          "class_name": "Cast",
          "config": {
            "dtype": "float16"
          },
          "registered_name": "Cast",
          "name": "cast_27",
          "inbound_nodes": [
            {
              "args": [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      224,
                      224,
                      3
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "ensemble_input",
                      0,
                      0
                    ]
                  }
                }
              ],
              "kwargs": {}
            }
          ]
        },
        {
          "module": "keras.src.ops.core",
          "class_name": "Cast",
          "config": {
            "dtype": "float16"
          },
          "registered_name": "Cast",
          "name": "cast_28",
          "inbound_nodes": [
            {
              "args": [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      224,
                      224,
                      3
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "ensemble_input",
                      0,
                      0
                    ]
                  }
                }
              ],
              "kwargs": {}
            }
          ]
        },
        {
          "module": "keras",
          "class_name": "Sequential",
          "config": {
            "name": "EfficientNetB0",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "class_name": "DTypePolicy",
              "config": {
                "name": "mixed_float16"
              },
              "registered_name": null
            },
            "layers": [
              {
                "module": "keras.layers",
                "class_name": "InputLayer",
                "config": {
                  "batch_shape": [
                    null,
                    224,
                    224,
                    3
                  ],
                  "dtype": "float16",
                  "sparse": false,
                  "name": "input_layer_9"
                },
                "registered_name": null
              },
              {
                "module": "keras.src.models.functional",
                "class_name": "Functional",
                "config": {
                  "name": "efficientnetb0",
                  "trainable": true,
                  "layers": [
                    {
                      "module": "keras.layers",
                      "class_name": "InputLayer",
                      "config": {
                        "batch_shape": [
                          null,
                          224,
                          224,
                          3
                        ],
                        "dtype": "float32",
                        "sparse": false,
                        "name": "input_layer_8"
                      },
                      "registered_name": null,
                      "name": "input_layer_8",
                      "inbound_nodes": []
                    },
                    {
                      "module": "keras.src.ops.core",
                      "class_name": "Cast",
                      "config": {
                        "dtype": "float16"
                      },
                      "registered_name": "Cast",
                      "name": "cast_17",
                      "inbound_nodes": [
                        {
                          "args": [
                            {
                              "class_name": "__keras_tensor__",
                              "config": {
                                "shape": [
                                  null,
                                  224,
                                  224,
                                  3
                                ],
                                "dtype": "float32",
                                "keras_history": [
                                  "input_layer_8",
                                  0,
                                  0
                                ]
                              }
                            }
                          ],
                          "kwargs": {}
                        }
                      ]
                    },
                    {
                      "module": "keras.layers",
                      "class_name": "Rescaling",
                      "config": {
                        "name": "rescaling_2",
                        "trainable": false,
                        "dtype": {
                          "module": "keras",
                          "class_name": "DTypePolicy",
                          "config": {
                            "name": "mixed_float16"
                          },
                          "registered_name": null
                        },
                        "scale": 0.00392156862745098,
                        "offset": 0.0
                      },
                      "registered_name": null,
                      "build_config": {
                        "input_shape": [
                          null,
                          224,
                          224,
                          3
                        ]
                      },
                      "name": "rescaling_2",
                      "inbound_nodes": [
                        {
                          "args": [
                            {
                              "class_name": "__keras_tensor__",
                              "config": {
                                "shape": [
                                  null,
                                  224,
                                  224,
                                  3
                                ],
                                "dtype": "float16",
                                "keras_history": [
                                  "cast_17",
                                  0,
                                  0
                                ]
                              }
                            }
                          ],
                          "kwargs": {}
                        }
                      ]
                    },
                    {
                      "module": "keras.layers",
                      "class_name": "Normalization",
                      "config": {
                        "name": "normalization_1",
                        "trainable": false,
                        "dtype": {
                          "module": "keras",
                          "class_name": "DTypePolicy",
                          "config": {
                            "name": "mixed_float16"
                          },
                          "registered_name": null
                        },
                        "axis": [
                          3
                        ],
                        "invert": false,
                        "mean": null,
                        "variance": null
                      },
                      "registered_name": null,
                      "build_config": {
                        "input_shape": [
                          null,
                          224,
                          224,
                          3
                        ]
                      },
                      "name": "normalization_1",
                      "inbound_nodes": [
                        {
                          "args": [
                            {
                              "class_name": "__keras_tensor__",
                              "config": {
                                "shape": [
                                  null,
                                  224,
                                  224,
                                  3
                                ],
                                "dtype": "float16",
                                "keras_history": [
                                  "rescaling_2",
                                  0,
                                  0
                                ]
                              }
                            }
                          ],
                          "kwargs": {}
                        }
                      ]
                    },
                    {
                      "module": "keras.layers",
                      "class_name": "Rescaling",
                      "config": {
                        "name": "rescaling_3",
                        "trainable": false,
                        "dtype": {
                          "module": "keras",
                          "class_name": "DTypePolicy",
                          "config": {
                            "name": "mixed_float16"
                          },
                          "registered_name": null
                        },
                        "scale": [
                          2.0896918976428642,
                          2.1128856368212916,
                          2.1081851067789197
                        ],
                        "offset": 0.0
                      },
                      "registered_name": null,
                      "build_config": {
                        "input_shape": [
                          null,
                          224,
                          224,
                          3
                        ]
                      },
                      "name": "rescaling_3",
                      "inbound_nodes": [
                        {
                          "args": [
                            {
                              "class_name": "__keras_tensor__",
                              "config": {
                                "shape": [
                                  null,
                                  224,
                                  224,
                                  3
                                ],
                                "dtype": "float16",
                                "keras_history": [
                                  "normalization_1",
                                  0,
                                  0
                                ]
                              }
                            }
                          ],
                          "kwargs": {}
                        }
                      ]
                    },
                    {
                      "module": "keras.layers",
                      "class_name": "ZeroPadding2D",
                      "config": {
                        "name": "stem_conv_pad",
                        "trainable": false,
                        "dtype": {
                          "module": "keras",
                          "class_name": "DTypePolicy",
                          "config": {
                            "name": "mixed_float16"
                          },
                          "registered_name": null
                        },
                        "padding": [
                          [
                            0,
                            1
                          ],
                          [
                            0,
                            1
                          ]
                        ],
                        "data_format": "channels_last"
                      },
                      "registered_name": null,
                      "build_config": {
                        "input_shape": [
                          null,
                          224,
                          224,
                          3
                        ]
                      },
                      "name": "stem_conv_pad",
                      "inbound_nodes": [
                        {
                          "args": [
                            {
                              "class_name": "__keras_tensor__",
                              "config": {
                                "shape": [
                                  null,
                                  224,
                                  224,
                                  3
                                ],
                                "dtype": "float16",
                                "keras_history": [
                                  "rescaling_3",
                                  0,
                                  0
                                ]
                              }
                            }
                          ],
                          "kwargs": {}
                        }
                      ]
                    },
                    {
                      "module": "keras.layers",
                      "class_name": "Conv2D",
                      "config": {
                        "name": "stem_conv",
                        "trainable": false,
                        "dtype": {
                          "module": "keras",
                          "class_name": "DTypePolicy",
                          "config": {
                            "name": "mixed_float16"
                          },
                          "registered_name": null
                        },
                        "filters": 32,
                        "kernel_size": [
                          3,
                          3
                        ],
                        "strides": [
                          2,
                          2
                        ],
                        "padding": "valid",
                        "data_format": "channels_last",
                        "dilation_rate": [
                          1,
                          1
                        ],
                        "groups": 1,
                        "activation": "linear",
                        "use_bias": false,
                        "kernel_initializer": {
                          "module": "keras.initializers",
                          "class_name": "VarianceScaling",
                          "config": {
                            "seed": null,
                            "scale": 2.0,
                            "mode": "fan_out",
                            "distribution": "truncated_normal"
                          },
                          "registered_name": null
                        },
                        "bias_initializer": {
                          "module": "keras.initializers",
                          "class_name": "Zeros",
                          "config": {},
                          "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                      },
                      "registered_name": null,
                      "build_config": {
                        "input_shape": [
                          null,
                          225,
                          225,
                          3
                        ]
                      },
                      "name": "stem_conv",
                      "inbound_nodes": [
                        {
                          "args": [
                            {
                              "class_name": "__keras_tensor__",
                              "config": {
                                "shape": [
                                  null,
                                  225,
                                  225,
                                  3
                                ],
                                "dtype": "float16",
                                "keras_history": [
                                  "stem_conv_pad",
                                  0,
                                  0
                                ]
                              }
                            }
                          ],
                          "kwargs": {}
                        }
                      ]
                    },
                    {
                      "module": "keras.layers",
                      "class_name": "BatchNormalization",
                      "config": {
                        "name": "stem_bn",
                        "trainable": false,
                        "dtype": {
                          "module": "keras",
                          "class_name": "DTypePolicy",
                          "config": {
                            "name": "mixed_float16"
                          },
                          "registered_name": null
                        },
                        "axis": 3,
                        "momentum": 0.99,
                        "epsilon": 0.001,
                        "center": true,
                        "scale": true,
                        "beta_initializer": {
                          "module": "keras.initializers",
                          "class_name": "Zeros",
                          "config": {},
                          "registered_name": null
                        },
                        "gamma_initializer": {
                          "module": "keras.initializers",
                          "class_name": "Ones",
                          "config": {},
                          "registered_name": null
                        },
                        "moving_mean_initializer": {
                          "module": "keras.initializers",
                          "class_name": "Zeros",
                          "config": {},
                          "registered_name": null
                        },
                        "moving_variance_initializer": {
                          "module": "keras.initializers",
                          "class_name": "Ones",
                          "config": {},
                          "registered_name": null
                        },
                        "beta_regularizer": null,
                        "gamma_regularizer": null,
                        "beta_constraint": null,
                        "gamma_constraint": null,
                        "synchronized": false
                      },
                      "registered_name": null,
                      "build_config": {
                        "input_shape": [
                          null,
                          112,
                          112,
                          32
                        ]
                      },
                      "name": "stem_bn",
                      "inbound_nodes": [
                        {
                          "args": [
                            {
                              "class_name": "__keras_tensor__",
                              "config": {
                                "shape": [
                                  null,
                                  112,
                                  112,
                                  32
                                ],
                                "dtype": "float16",
                                "keras_history": [
                                  "stem_conv",
                                  0,
                                  0
                                ]
                              }
                            }
                          ],
                          "kwargs": {
                            "mask": null
                          }
                        }
                      ]
                    },
                    {
                      "module": "keras.layers",
                      "class_name": "Activation",
                      "config": {
                        "name": "stem_activation",
                        "trainable": false,
                        "dtype": {
                          "module": "keras",
                          "class_name": "DTypePolicy",
                          "config": {
                            "name": "mixed_float16"
                          },
                          "registered_name": null
                        },
                        "activation": "silu"
                      },
                      "registered_name": null,
                      "name": "stem_activation",
                      "inbound_nodes": [
                        {
                          "args": [
                            {
                              "class_name": "__keras_tensor__",
                              "config": {
                                "shape": [
                                  null,
                                  112,
                                  112,
                                  32
                                ],
                                "dtype": "float16",
                                "keras_history": [
                                  "stem_bn",
                                  0,
                                  0
                                ]
                              }
                            }
                          ],
                          "kwargs": {}
                        }
                      ]
                    },
                    {
                      "module": "keras.layers",
                      "class_name": "DepthwiseConv2D",
                      "config": {
                        "name": "block1a_dwconv",
                        "trainable": false,
                        "dtype": {
                          "module": "keras",
                          "class_name": "DTypePolicy",
                          "config": {
                            "name": "mixed_float16"
                          },
                          "registered_name": null
                        },
                        "depth_multiplier": 1,
                        "kernel_size": [
                          3,
                          3
                        ],
                        "strides": [
                          1,
                          1
                        ],
                        "padding": "same",
                        "data_format": "channels_last",
                        "dilation_rate": [
                          1,
                          1
                        ],
                        "activation": "linear",
                        "use_bias": false,
                        "depthwise_initializer": {
                          "module": "keras.initializers",
                          "class_name": "VarianceScaling",
                          "config": {
                            "seed": null,
                            "scale": 2.0,
                            "mode": "fan_out",
                            "distribution": "truncated_normal"
                          },
                          "registered_name": null
                        },
                        "bias_initializer": {
                          "module": "keras.initializers",
                          "class_name": "Zeros",
                          "config": {},
                          "registered_name": null
                        },
                        "depthwise_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "depthwise_constraint": null,
                        "bias_constraint": null
                      },
                      "registered_name": null,
                      "build_config": {
                        "input_shape": [
                          null,
                          112,
                          112,
                          32
                        ]
                      },
                      "name": "block1a_dwconv",
                      "inbound_nodes": [
                        {
                          "args": [
                            {
                              "class_name": "__keras_tensor__",
                              "config": {
                                "shape": [
                                  null,
                                  112,
                                  112,
                                  32
                                ],
                                "dtype": "float16",
                                "keras_history": [
                                  "stem_activation",
                                  0,
                                  0
                                ]
                              }
                            }
                          ],
                          "kwargs": {}
                        }
                      ]
                    },
                    {
                      "module": "keras.layers",
                      "class_name": "BatchNormalization",
                      "config": {
                        "name": "block1a_bn",
                        "trainable": false,
                        "dtype": {
                          "module": "keras",
                          "class_name": "DTypePolicy",
                          "config": {
                            "name": "mixed_float16"
                          },
                          "registered_name": null
                        },
                        "axis": 3,
                        "momentum": 0.99,
                        "epsilon": 0.001,
                        "center": true,
                        "scale": true,
                        "beta_initializer": {
                          "module": "keras.initializers",
                          "class_name": "Zeros",
                          "config": {},
                          "registered_name": null
                        },
                        "gamma_initializer": {
                          "module": "keras.initializers",
                          "class_name": "Ones",
                          "config": {},
                          "registered_name": null
                        },
                        "moving_mean_initializer": {
                          "module": "keras.initializers",
                          "class_name": "Zeros",
                          "config": {},
                          "registered_name": null
                        },
                        "moving_variance_initializer": {
                          "module": "keras.initializers",
                          "class_name": "Ones",
                          "config": {},
                          "registered_name": null
                        },
                        "beta_regularizer": null,
                        "gamma_regularizer": null,
                        "beta_constraint": null,
                        "gamma_constraint": null,
                        "synchronized": false
                      },
                      "registered_name": null,
                      "build_config": {
                        "input_shape": [
                          null,
                          112,
                          112,
                          32
                        ]
                      },
                      "name": "block1a_bn",
                      "inbound_nodes": [
                        {
                          "args": [
                            {
                              "class_name": "__keras_tensor__",
                              "config": {
                                "shape": [
                                  null,
                                  112,
                                  112,
                                  32
                                ],
                                "dtype": "float16",
                                "keras_history": [
                                  "block1a_dwconv",
                                  0,
                                  0
                                ]
                              }
                            }
                          ],
                          "kwargs": {
                            "mask": null
                          }
                        }
                      ]
                    },
                    {
                      "module": "keras.layers",
                      "class_name": "Activation",
                      "config": {
                        "name": "block1a_activation",
                        "trainable": false,
                        "dtype": {
                          "module": "keras",
                          "class_name": "DTypePolicy",
                          "config": {
                            "name": "mixed_float16"
                          },
                          "registered_name": null
                        },
                        "activation": "silu"
                      },
                      "registered_name": null,
                      "name": "block1a_activation",
                      "inbound_nodes": [
                        {
                          "args": [
                            {
                              "class_name": "__keras_tensor__",
                              "config": {
                                "shape": [
                                  null,
                                  112,
                                  112,
                                  32
                                ],
                                "dtype": "float16",
                                "keras_history": [
                                  "block1a_bn",
                                  0,
                                  0
                                ]
                              }
                            }
                          ],
                          "kwargs": {}
                        }
                      ]
                    },
                    {
                      "module": "keras.layers",
                      "class_name": "GlobalAveragePooling2D",
                      "config": {
                        "name": "block1a_se_squeeze",
                        "trainable": false,
                        "dtype": {
                          "module": "keras",
                          "class_name": "DTypePolicy",
                          "config": {
                            "name": "mixed_float16"
                          },
                          "registered_name": null
                        },
                        "data_format": "channels_last",
                        "keepdims": false
                      },
                      "registered_name": null,
                      "name": "block1a_se_squeeze",
                      "inbound_nodes": [
                        {
                          "args": [
                            {
                              "class_name": "__keras_tensor__",
                              "config": {
                                "shape": [
                                  null,
                                  112,
                                  112,
                                  32
                                ],
                                "dtype": "float16",
                                "keras_history": [
                                  "block1a_activation",
                                  0,
                                  0
                                ]
                              }
                            }
                          ],
                          "kwargs": {}
                        }
                      ]
                    },
                    {
                      "module": "keras.layers",
                      "class_name": "Reshape",
                      "config": {
                        "name": "block1a_se_reshape",
                        "trainable": false,
                        "dtype": {
                          "module": "keras",
                          "class_name": "DTypePolicy",
                          "config": {
                            "name": "mixed_float16"
                          },
                          "registered_name": null
                        },
                        "target_shape": [
                          1,
                          1,
                          32
                        ]
                      },
                      "registered_name": null,
                      "build_config": {
                        "input_shape": [
                          null,
                          32
                        ]
                      },
                      "name": "block1a_se_reshape",
                      "inbound_nodes": [
                        {
                          "args": [
                            {
                              "class_name": "__keras_tensor__",
                              "config": {
                                "shape": [
                                  null,
                                  32
                                ],
                                "dtype": "float16",
                                "keras_history": [
                                  "block1a_se_squeeze",
                                  0,
                                  0
                                ]
                              }
                            }
                          ],
                          "kwargs": {}
                        }
                      ]
                    },
                    {
                      "module": "keras.layers",
                      "class_name": "Conv2D",
                      "config": {
                        "name": "block1a_se_reduce",
                        "trainable": false,
                        "dtype": {
                          "module": "keras",
                          "class_name": "DTypePolicy",
                          "config": {
                            "name": "mixed_float16"
                          },
                          "registered_name": null
                        },
                        "filters": 8,
                        "kernel_size": [
                          1,
                          1
                        ],
                        "strides": [
                          1,
                          1
                        ],
                        "padding": "same",
                        "data_format": "channels_last",
                        "dilation_rate": [
                          1,
                          1
                        ],
                        "groups": 1,
                        "activation": "silu",
                        "use_bias": true,
                        "kernel_initializer": {
                          "module": "keras.initializers",
                          "class_name": "VarianceScaling",
                          "config": {
                            "seed": null,
                            "scale": 2.0,
                            "mode": "fan_out",
                            "distribution": "truncated_normal"
                          },
                          "registered_name": null
                        },
                        "bias_initializer": {
                          "module": "keras.initializers",
                          "class_name": "Zeros",
                          "config": {},
                          "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                      },
                      "registered_name": null,
                      "build_config": {
                        "input_shape": [
                          null,
                          1,
                          1,
                          32
                        ]
                      },
                      "name": "block1a_se_reduce",
                      "inbound_nodes": [
                        {
                          "args": [
                            {
                              "class_name": "__keras_tensor__",
                              "config": {
                                "shape": [
                                  null,
                                  1,
                                  1,
                                  32
                                ],
                                "dtype": "float16",
                                "keras_history": [
                                  "block1a_se_reshape",
                                  0,
                                  0
                                ]
                              }
                            }
                          ],
                          "kwargs": {}
                        }
                      ]
                    },
                    {
                      "module": "keras.layers",
                      "class_name": "Conv2D",
                      "config": {
                        "name": "block1a_se_expand",
                        "trainable": false,
                        "dtype": {
                          "module": "keras",
                          "class_name": "DTypePolicy",
                          "config": {
                            "name": "mixed_float16"
                          },
                          "registered_name": null
                        },
                        "filters": 32,
                        "kernel_size": [
                          1,
                          1
                        ],
                        "strides": [
                          1,
                          1
                        ],
                        "padding": "same",
                        "data_format": "channels_last",
                        "dilation_rate": [
                          1,
                          1
                        ],
                        "groups": 1,
                        "activation": "sigmoid",
                        "use_bias": true,
                        "kernel_initializer": {
                          "module": "keras.initializers",
                          "class_name": "VarianceScaling",
                          "config": {
                            "seed": null,
                            "scale": 2.0,
                            "mode": "fan_out",
                            "distribution": "truncated_normal"
                          },
                          "registered_name": null
                        },
                        "bias_initializer": {
                          "module": "keras.initializers",
                          "class_name": "Zeros",
                          "config": {},
                          "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                      },
                      "registered_name": null,
                      "build_config": {
                        "input_shape": [
                          null,
                          1,
                          1,
                          8
                        ]
                      },
                      "name": "block1a_se_expand",
                      "inbound_nodes": [
                        {
                          "args": [
                            {
                              "class_name": "__keras_tensor__",
                              "config": {
                                "shape": [
                                  null,
                                  1,
                                  1,
                                  8
                                ],
                                "dtype": "float16",
                                "keras_history": [
                                  "block1a_se_reduce",
                                  0,
                                  0
                                ]
                              }
                            }
                          ],
                          "kwargs": {}
                        }
                      ]
                    },
                    {
                      "module": "keras.layers",
                      "class_name": "Multiply",
                      "config": {
                        "name": "block1a_se_excite",
                        "trainable": false,
                        "dtype": {
                          "module": "keras",
                          "class_name": "DTypePolicy",
                          "config": {
                            "name": "mixed_float16"
                          },
                          "registered_name": null
                        }
                      },
                      "registered_name": null,
                      "build_config": {
                        "input_shape": [
                          [
                            null,
                            112,
                            112,
                            32
                          ],
                          [
                            null,
                            1,
                            1,
                            32
                          ]
                        ]
                      },
                      "name": "block1a_se_excite",
                      "inbound_nodes": [
                        {
                          "args": [
                            [
                              {
                                "class_name": "__keras_tensor__",
                                "config": {
                                  "shape": [
                                    null,
                                    112,
                                    112,
                                    32
                                  ],
                                  "dtype": "float16",
                                  "keras_history": [
                                    "block1a_activation",
                                    0,
                                    0
                                  ]
                                }
                              },
                              {
                                "class_name": "__keras_tensor__",
                                "config": {
                                  "shape": [
                                    null,
                                    1,
                                    1,
                                    32
                                  ],
                                  "dtype": "float16",
                                  "keras_history": [
                                    "block1a_se_expand",
                                    0,
                                    0
                                  ]
                                }
                              }
                            ]
                          ],
                          "kwargs": {}
                        }
                      ]
                    },
                    {
                      "module": "keras.layers",
                      "class_name": "Conv2D",
                      "config": {
                        "name": "block1a_project_conv",
                        "trainable": false,
                        "dtype": {
                          "module": "keras",
                          "class_name": "DTypePolicy",
                          "config": {
                            "name": "mixed_float16"
                          },
                          "registered_name": null
                        },
                        "filters": 16,
                        "kernel_size": [
                          1,
                          1
                        ],
                        "strides": [
                          1,
                          1
                        ],
                        "padding": "same",
                        "data_format": "channels_last",
                        "dilation_rate": [
                          1,
                          1
                        ],
                        "groups": 1,
                        "activation": "linear",
                        "use_bias": false,
                        "kernel_initializer": {
                          "module": "keras.initializers",
                          "class_name": "VarianceScaling",
                          "config": {
                            "seed": null,
                            "scale": 2.0,
                            "mode": "fan_out",
                            "distribution": "truncated_normal"
                          },
                          "registered_name": null
                        },
                        "bias_initializer": {
                          "module": "keras.initializers",
                          "class_name": "Zeros",
                          "config": {},
                          "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                      },
                      "registered_name": null,
                      "build_config": {
                        "input_shape": [
                          null,
                          112,
                          112,
                          32
                        ]
                      },
                      "name": "block1a_project_conv",
                      "inbound_nodes": [
                        {
                          "args": [
                            {
                              "class_name": "__keras_tensor__",
                              "config": {
                                "shape": [
                                  null,
                                  112,
                                  112,
                                  32
                                ],
                                "dtype": "float16",
